Tekla.Structures.Model.PolygonNode
The PolygonNode class represents flat geometry tree node.

Tekla.Structures.Model.PolygonNode.#ctor(Tekla.Structures.Model.Contour,System.Boolean)
Initializes a new instance of the PolygonNode class.
contour: The contour points of the node.
isAutomaticNode: true if the node represents an automatically generated extension.

Tekla.Structures.Model.PolygonNode.IsAutomatic
Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)

Tekla.Structures.Model.PolygonNode.Contour
Gets or sets the contour points of flat geometry.

Tekla.Structures.Model.PolygonNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)
Entry method for the visitor pattern
visitor:

Tekla.Structures.Model.PolygonNode.Clone
Creates a new object that is a copy of the current instance.
Returns: A new object that is a copy of the current instance.